# OLA WAHBA
# GO_STP_6027    -- GoeduHub Technologies
# Pandas Dummy Variables and One-hot encoding sklearn¶

***Discuss the concept of One-Hot-Encoding, Multicollinearity and the Dummy Variable Trap.  What is Nominal and Ordinal Variables ?***

One hot encoding is a process of converting categorical data variables so they can be provided to machine learning algorithms to improve predictions. One hot encoding is a crucial part of feature engineering for machine learning.

A dummy variable is a numeric variable which represents the sub-categories or sub-groups of the categorical variables of the dataset.


Multicollinearity occurs when independent variables in a regression model are correlated.

Ordinal data is a type of categorical data with an order. The variables in ordinal data are listed in an ordered manner. The ordinal variables are usually numbered.
Nominal data is defined as data that is used for naming or labelling variables, without any quantitative value. It is sometimes called “named” data

***Salary Dataset of 52 professors having categorical columns. Apply dummy variables concept and one-hot-encoding on categorical columns.***

In [24]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [38]:
df=pd.read_table('https://raw.githubusercontent.com/OLA333/Goeduhub-Technologies/main/salary.dat.txt', delim_whitespace = True)
df.head()

       sx    rk  yr         dg  yd     sl
0    male  full  25  doctorate  35  36350
1    male  full  13  doctorate  22  35350
2    male  full  10  doctorate  23  28200
3  female  full   7  doctorate  27  26775
4    male  full  19    masters  30  33696

In [39]:
df.columns

Index(['sx', 'rk', 'yr', 'dg', 'yd', 'sl'], dtype='object')

In [53]:
df['sx'].unique()

array(['male', 'female'], dtype=object)

In [52]:
df['rk'].unique()

array(['full', 'associate', 'assistant'], dtype=object)

In [54]:
df['dg'].unique()

array(['doctorate', 'masters'], dtype=object)

**Dummy** **variables**:

In [57]:
dummy=pd.get_dummies(df[['sx','rk','dg']],drop_first=True)

In [58]:
dummy.head()

   sx_male  rk_associate  rk_full  dg_masters
0        1             0        1           0
1        1             0        1           0
2        1             0        1           0
3        0             0        1           0
4        1             0        1           1

In [61]:
df1=pd.concat([dummy,df],axis=1)
df1.head()

   sx_male  rk_associate  rk_full  dg_masters  ...  yr         dg  yd     sl
0        1             0        1           0  ...  25  doctorate  35  36350
1        1             0        1           0  ...  13  doctorate  22  35350
2        1             0        1           0  ...  10  doctorate  23  28200
3        0             0        1           0  ...   7  doctorate  27  26775
4        1             0        1           1  ...  19    masters  30  33696

[5 rows x 10 columns]

In [65]:
df1.drop(['sx','rk','dg'],axis=1,inplace=True)
df1.head()

   sx_male  rk_associate  rk_full  dg_masters  yr  yd     sl
0        1             0        1           0  25  35  36350
1        1             0        1           0  13  22  35350
2        1             0        1           0  10  23  28200
3        0             0        1           0   7  27  26775
4        1             0        1           1  19  30  33696

**One-hot Encoding**

In [71]:
from sklearn.preprocessing import LabelEncoder
lb=LabelEncoder()

In [75]:
df['sx']=lb.fit_transform(df['sx'])
df.rk=lb.fit_transform(df['rk'])
df['dg']=lb.fit_transform(df['dg'])
df.head()

   sx  rk  yr  dg  yd     sl
0   1   2  25   0  35  36350
1   1   2  13   0  22  35350
2   1   2  10   0  23  28200
3   0   2   7   0  27  26775
4   1   2  19   1  30  33696